<?php

//Φ((Z-μ)/σ)  计算先计算出比例0.81 查高斯分布表 得到该比例标准高斯分布的x轴值如0.91  (Z-u)/o=0.91
//N(u,o的二次方) 转变成N(0,1) (Z-u)/o 得到值符合高斯分布  如算出的比例 0.9888去查表  找到对应比例的值 拿出如2.09
//(Z-u)/o=2.09 计算出o
//
$u = 0;
$o = 1;
$x = 0;
$total = 0;
$totalMiddle = 0;
$v = (1 / $o * sqrt(2 * pi())) * exp(-1 * pow(($x - $u), 2) / (2 * pow($o, 2)));
for ($i = -3; $i <= 3; $i += .01) {
    $x = $i;
    $u = 0;//期望值 正态分布的数学期望值或期望值 等于位置参数，决定了分布的位置 值越大 向右移 值越小 向左移
    $o = 1;//方差 尺度参数，决定了分布的幅度 值越大 曲线越平 值越小 曲线越陡峭
    $v = (1 / ($o * sqrt(2 * pi()))) * exp(-1 * pow(($x - $u), 2) / (2 * pow($o, 2)));
    echo $i . ":" . intval($v*1000) . PHP_EOL;
    $totalMiddle += $v;
    if ($i >= 0) {
        continue;
    }
    $total += $v;
}
var_dump($total);
var_dump($totalMiddle);
